练度流程列表['Cartethyia'] = {
    标题: '卡提希娅 2.4.5 ',
    声骸配置: {
        "声骸-1": "44%爆伤+150攻击",
        "声骸-2": "30%属伤+100攻击",
        "声骸-3": "30%属伤+100攻击",
        "声骸-4": "18%攻击+2280生命",
        "声骸-5": "18%攻击+2280生命",
        "声骸-暴击": "42",
        "声骸-爆伤": "84",
        "声骸-大攻击": "27",
        "声骸-小攻击": "0",
        "声骸-普攻伤害加成": "0",
        "声骸-重击伤害加成": "0",
        "声骸-共鸣技能伤害加成": "0",
        "声骸-共鸣解放伤害加成": "0",
        "敌方等级": "100",
        "敌方抗性": "20"
    },
    buff_列表: {

        //         固有技能
        // 以风刻痕留蚀
        // 每当目标拥有1层风蚀效应，【卡提希娅】与【芙露德莉斯】对其造成的伤害提升10%，最多可叠加至60%。

        // 【显化】状态下：
        // 【芙露德莉斯】的气动伤害加成提升60%。


        //         当【芙露德莉斯】拥有【神权之意】和【显化】状态时获得以下效果：
        // 【芙露德莉斯】自身一定范围内，目标风蚀效应触发的间隔减少50%，并使目标受到的风蚀效应伤害加深50%。

        // 施放共鸣解放·看潮怒风哮之刃，回复自身70%生命上限的生命值，并对前方直线范围内目标，造成气动伤害，命中目标时，会清空目标拥有的风蚀效应。造成伤害前目标每拥有1层风蚀效应，目标受到的伤害提升20%，至多5层。


        // 不屈命定之冠
        // 生命
        // 72.2%
        // 自由骑士之舞
        // 生命提升12%。施放变奏技能或普攻后null秒内，自身造成伤害无视目标8%防御力，当目标的风蚀效应大于1层时，对目标造成的伤害加深20%。

        // 流云逝尽之空
        // 2件: 气动伤害提升10%
        // 5件: 角色为敌人添加【风蚀效应】时，队伍中角色气动伤害提升15%，自身气动伤害额外提升15%，持续20秒。

        // 愿戴荣光之旅
        // 2件: 气动伤害提升10%
        // 5件: 角色攻击命中存在【风蚀效应】的敌人时，自身暴击提升10%，气动伤害加成提升30%，持续10秒。

        // 使用声骸技能，召唤【破空幻刃】，攻击目标，造成八段27.36%和一段136.80%的气动伤害。
        // 在首位装配该声骸技能时，自身气动伤害加成提升10.00%，当装配角色为漂泊者·气动或卡提希娅时，自身气动伤害加成额外提升10.00%。
        // 技能冷却：20秒


        //         音律独奏
        // 夏空或合奏音影在进入音律独奏状态时能够以自身为中心，使附近队伍中所有角色的气动伤害加成提升24%，该效果不可叠加。

        // 延奏技能
        // 和声引风
        // 队伍中登场角色周围的目标受到【test/风蚀效应】的伤害加深100%，持续30秒。

        // 林间的咏叹调
        // 长夏咏颂
        // 攻击提升12%。为目标添加【风蚀效应】后，自身气动伤害加成提升24%，持续10秒。攻击命中带有【风蚀效应】的敌人时，降低对方10%的气动抗性，持续20秒，同名效果之间不可叠加。

        '卡提希娅': {
            属性: {
                基础攻击: 14800,
                大攻击: 12,
                暴击: 5 + 8,
                爆伤: 150,
                等级: 90,
            },
        },


        '卡提希娅-60增伤-风蚀': { 属性: { 增伤: 60 }, 描述: '每当目标拥有1层【风蚀效应】，【卡提希娅】与【芙露德莉斯】对其造成的伤害提升10%，最多可叠加至60%。' },
        '芙露德莉斯-60增伤-显化': { 属性: { 增伤: 60 }, 描述: '【显化】状态下：【芙露德莉斯】的气动伤害加成提升60%。' },

        '芙露德莉斯-50风蚀加深': { 属性: { 加深: 50 }, 标签: '风蚀', 描述: '当【芙露德莉斯】拥有【神权之意】和【显化】状态时获得以下效果：【芙露德莉斯】自身一定范围内，目标【风蚀效应】触发的间隔减少50%，并使目标受到的【风蚀效应】伤害加深50%。' },

        '芙露德莉斯-R-100加深': { 属性: { 加深: 100 }, 标签: '共鸣解放·看潮怒风哮之刃', 描述: '此次伤害在非【显化】状态下气动伤害加成提升60%，造成伤害前目标每拥有1层【风蚀效应】，目标受到的伤害加深20%，至多5层。' },

        '不屈命定之冠': { 属性: { 大攻击: 72.2 + 12 } },

        '不屈命定之冠-8减防-20加深': { 属性: { 无视防御: 8, 加深: 20 }, 描述: '施放变奏技能或普攻后15秒内，自身造成伤害无视目标8%防御力，当目标的风蚀效应大于1层时，对目标造成的伤害加深20%。' },
        '4C-20增伤': { 属性: { 增伤: 20 } },
        '流云逝尽之空-15增伤': { 属性: { 增伤: 15 }, 描述: '角色为敌人添加【风蚀效应】时，队伍中角色气动伤害提升15%，自身气动伤害额外提升15%，持续20秒。' },
        '愿戴荣光之旅-10暴击-40增伤': { 属性: { 暴击: 10, 增伤: 40 }, 描述: '角色攻击命中存在【风蚀效应】的敌人时，自身暴击提升10%，气动伤害加成提升30%，持续10秒。' },

        '夏空-24增伤': { 属性: { 增伤: 24 }, 描述: '夏空或合奏音影在进入音律独奏状态时能够以自身为中心，使附近队伍中所有角色的气动伤害加成提升24%，该效果不可叠加。' },
        '夏空-100风蚀加深': { 属性: { 加深: 100 }, 标签: '风蚀', 描述: '队伍中登场角色周围的目标受到【风蚀效应】的伤害加深100%，持续30秒。' },
        '夏空专武-10抗': { 属性: { 抗性: -10 }, 描述: '攻击命中带有【风蚀效应】的敌人时，降低对方10%的气动抗性，持续20秒，同名效果之间不可叠加。' },

        '声骸-44111': {
            属性: {
                暴击: 22,
                爆伤: 44,
                大攻击: 22.8 * 3,
                小攻击: 2280 * 3,
            }
        },

        '守岸人-12.5暴击': { 属性: { 暴击: 12.5 }, 描述: '星域持续时间30秒' },
        '守岸人-25爆伤': { 属性: { 爆伤: 25 }, 描述: '星域持续时间30秒' },
        '守岸人-15加深': { 属性: { 加深: 15 }, 描述: '队伍中的角色全伤害加深15%。最多存在30秒' },

    },
    流程: function () {

        this.add_buff('敌方属性')
        this.add_buff('卡提希娅')

        this.add_buff('不屈命定之冠')
        this.add_buff('不屈命定之冠-8减防-20加深')

        this.add_buff('声骸-44111')

        for (const key in this.buff_列表) {
            if (!key.startsWith('声骸-副词条'))
                continue
            this.add_buff(key)
        }

        this.add_buff('守岸人-12.5暴击')
        this.add_buff('守岸人-25爆伤')
        this.add_buff('守岸人-15加深')

        this.add_buff('夏空-24增伤')
        this.add_buff('夏空-100风蚀加深')
        // this.add_buff('夏空专武-10抗')
        this.add_buff('流云逝尽之空-15增伤')

        this.add_buff('4C-20增伤')
        this.add_buff('愿戴荣光之旅-10暴击-40增伤')

        this.add_buff('卡提希娅-60增伤-风蚀')

        // this.add_buff('芙露德莉斯-60增伤-显化')
        this.add_buff('芙露德莉斯-50风蚀加深')
        this.add_buff('芙露德莉斯-R-100加深')


        this.add_action('普攻·卡提希娅第一段伤害', .0478, '普攻')
        this.add_action('第二段伤害', .0394 + .0394 + .0525, '普攻')
        this.add_action('第三段伤害', .0428 + .0428 + .0428 + .0428, '普攻')
        this.add_action('第四段伤害', .0252 * 3 + .0754, '普攻')
        this.add_action('闪避反击伤害', .0685 + .0685 + .0685 + .0685, '普攻')
        this.add_action('重击伤害', .0208 * 3 + .0624, '普攻')
        this.add_action('空中攻击', .0565, '普攻', '风蚀')
        this.add_action('空中攻击回收一剑', .0565, '普攻', '风蚀')
        this.add_action('空中攻击回收二剑', .0330 * 3, '普攻', '风蚀')
        this.add_action('空中攻击回收三剑', .1129 * 3, '普攻', '风蚀')

        this.add_action('普攻·芙露德莉斯第一段伤害', .0649, '普攻')
        this.add_action('普攻第二段伤害', .0363 + .0182 + .0182 + .0182, '普攻')
        this.add_action('普攻第三段伤害', .0213 + .0213 + .0213 + .0426, '普攻')
        this.add_action('普攻第四段伤害', .0274 * 5, '普攻')
        this.add_action('普攻第五段伤害', .0720 + .2880, '普攻')
        this.add_action('闪避反击伤害', .0320 + .0320 + .0320 + .0639, '普攻')
        this.add_action('上挑攻击伤害', .0454 * 2, '普攻')
        this.add_action('重击伤害', .0428 + .0997, '普攻')
        this.add_action('强化重击伤害', .0778 * 2 + .0389, '普攻')
        this.add_action('空中攻击第一段伤害', .0299 + .0299 + .0308, '普攻')
        this.add_action('空中攻击第二段伤害', .0739 + .0739 + .1477, '普攻')
        this.add_action('空中攻击第三段伤害', .0220, '普攻')

        this.add_action('共鸣技能·此剑为潮浪之意伤害', .0186 * 4 + .1736, '共鸣技能')
        this.add_action('共鸣技能·凭风斩浪破敌伤害', .0186 * 2 + .0703 * 3, '共鸣技能')

        this.add_action('共鸣技能·卡提希娅伤害', .0689 * 3 + .0886, '普攻')

        this.add_action('共鸣解放·看潮怒风哮之刃', .1312 * 7, '共鸣解放')

        this.add_action('此剑，为潮水的过去伤害', .0208 * 3 + .0624)
        this.add_action('此剑，为自由的未来伤害', .0428 + .0997)


    }

}