
练度流程列表['changli'] =
{
    标题: '长离总倍率: 45.8929 总加深倍率: 52.7768 总伤害: 531299.7',
    声骸配置: {
        "声骸-1": "44%爆伤+150攻击",
        "声骸-2": "30%属伤+100攻击",
        "声骸-3": "30%属伤+100攻击",
        "声骸-4": "18%攻击+2280生命",
        "声骸-5": "18%攻击+2280生命",
        "声骸-暴击": "42",
        "声骸-爆伤": "84",
        "声骸-大攻击": "45",
        "声骸-小攻击": "0",
        "声骸-普攻伤害加成": "0",
        "声骸-重击伤害加成": "0",
        "声骸-共鸣技能伤害加成": "45",
        "声骸-共鸣解放伤害加成": "0",
        "敌方等级": "100",
        "敌方抗性": "20"
    },
    buff_列表: {
        '角色基础': { 属性: { 暴击: 5, 爆伤: 150 } },
        // '敌方属性': { 属性: { 敌方等级: parseInt(参数设置.敌方等级), 抗性: parseInt(参数设置.敌方抗性) } },
        '长离': { 属性: { 等级: 90, 基础攻击: 463 - 1, 大攻击: 12, 暴击: 8 } },

        '长离-5增伤': { 属性: { 增伤: 5 }, 标签: '固有1', 描述: '施放普攻心眼·征或普攻心眼·冲时，每拥有1层【离火】，长离的热熔伤害加成提升5%。' },
        '长离-20增伤-15无视防御': { 属性: { 无视防御: 15, 增伤: 20 }, 标签: '固有2', 描述: '施放重击焚身以火或共鸣解放离火照丹心时，长离的热熔伤害加成提升20%，攻击造成伤害时忽视目标15%防御。' },
        '长离-焰羽-25攻-20增伤-15无视防御': { 属性: { 大攻击: 25 }, 标签: '焰羽', 描述: '10秒内施放重击焚身以火时攻击提升25%，施放后效果提前结束。' },

        '千古洑流': { 属性: { 基础攻击: 588 - 1, 暴击: 24.3 } },
        '千古洑流-6攻*2': { 属性: { 大攻击: 6 }, 描述: '施放共鸣技能时，攻击提升6%，可叠加2层，持续10秒。' },

        '熔山裂谷2-10增伤': { 属性: { 增伤: 10 }, },
        '熔山裂谷4-30增伤': { 属性: { 增伤: 30 }, 描述: '使用共鸣技能时，热熔伤害提升30%，持续15秒' },

        '梦魇·燎照之骑-12增伤': { 属性: { 增伤: 12 } },
        '梦魇·燎照之骑-12共鸣': { 属性: { 增伤: 12 }, 标签: '共鸣技能' },

        // '散华-38普攻加深-14s': { 属性: { 加深: 38 }, 标签: '普攻', 描述: '持续14秒' },
        '散华-20攻-20s-6链': { 属性: { 大攻击: 20 }, 标签: '实战', 描述: '引爆【冰棱】或【冰川】后，队伍中的角色攻击提升10%，持续20秒，可叠加2层。' },

        '守岸人-12.5暴击': { 属性: { 暴击: 12.5 }, 描述: '星域持续时间30秒' },
        '守岸人-25爆伤': { 属性: { 爆伤: 25 }, 描述: '星域持续时间30秒' },
        '守岸人-15加深': { 属性: { 加深: 15 }, 描述: '队伍中的角色全伤害加深15%。最多存在30秒' },

        '轻云出月-22.5攻-15s': { 属性: { 大攻击: 22.5 }, 标签: '实战', 描述: '使用延奏技能后，下一个登场的共鸣者攻击提升22.5%，持续15秒' },
        '无常凶鹭-12增伤-15s': { 属性: { 增伤: 12 }, 标签: '实战', 描述: '下一个变奏登场的角色伤害提升12%，持续15秒。技能冷却：20秒' },

        '隐世回光-15攻-30s': { 属性: { 大攻击: 15 }, 描述: '自身为友方提供治疗时，全队共鸣者攻击提升15%，持续30秒' },
        '无归的谬误-10攻-20s': { 属性: { 大攻击: 10 }, 描述: '全队角色攻击提升10%，持续20秒。技能冷却：20秒' },

        // ...声骸属性,
        '声骸-实战': { 属性: { 爆伤: 44, 大攻击: 36, 小攻击: 350, 增伤: 60 }, 标签: '实战' },
        '声骸-实战-副词条': { 属性: { "暴击": 31.2, 爆伤: 131 - 44, 大攻击: 18, 小攻击: 110 }, 标签: '实战' },
        '声骸-实战-副词条-共鸣技能': { 属性: { 增伤: 19.5 }, 标签: '共鸣技能,实战' },
        '声骸-实战-副词条-共鸣解放': { 属性: { 增伤: 7.9 }, 标签: '共鸣解放,实战' },

        '深塔-顺10抗': { 属性: { 抗性: -10 }, 标签: '实战' },
        '深塔-6增伤': { 属性: { 增伤: 6 }, 标签: '实战', 描述: '角色释放声骸技能时，全队全属性伤害提升6%，最多叠加4层，同角色的同名声骸技能无法重复触发该效果。叠加至4层时，全队暴击伤害提升36%。' },

    },
    流程: function () {


        this.add_buff("角色基础")
        this.add_buff("敌方属性")
        this.add_buff("长离")
        this.add_buff("长离-20增伤-15无视防御")
        this.add_buff("长离-焰羽-25攻-20增伤-15无视防御")


        for (const key in this.buff_列表) {
            if (!key.startsWith('声骸'))
                continue
            this.add_buff(key)
        }

        this.add_buff("千古洑流")
        this.add_buff("熔山裂谷2-10增伤")
        this.add_buff("熔山裂谷4-30增伤")
        this.add_buff("梦魇·燎照之骑-12增伤")
        this.add_buff("梦魇·燎照之骑-12共鸣")
        this.add_buff("散华-20攻-20s-6链")
        this.add_buff("守岸人-12.5暴击")
        this.add_buff("守岸人-15加深")
        this.add_buff("隐世回光-15攻-30s")
        this.add_buff("无归的谬误-10攻-20s")
        this.add_buff("深塔-6增伤", 3)
        this.add_buff("深塔-顺10抗")

        this.add_buff("千古洑流-6攻*2")
        this.add_action('/check 变奏 1167', .1306)

        this.add_action("变奏", .4450 + .2596 * 4)

        this.add_buff("长离-5增伤")

        this.add_action("/check 跳 7523", .7268, '共鸣技能', '固有1')
        this.add_action("/check 跳 11284", 1.0902, '共鸣技能', '固有1')

        this.add_action("跳", .7268 + 1.0902, '共鸣技能', '固有1')

        this.add_buff("千古洑流-6攻*2")

        this.add_action("/check E 17015", 1.6376, '共鸣技能')

        this.add_action("E", .8188 * 3 + 1.6376, '共鸣技能')

        this.add_buff("长离-5增伤")

        this.add_action("/check A 6360", .5895, '共鸣技能', '固有1')

        this.add_action("A", .5895 * 2 + .8252 + .9431, '共鸣技能', '固有1')

        this.add_buff("守岸人-25爆伤")

        this.add_buff("轻云出月-22.5攻-15s")
        this.add_buff("无常凶鹭-12增伤-15s")

        this.add_action('/check 变奏 1483', .1306)

        this.add_action("变奏", .4450 + .2596 * 4)

        this.add_buff("长离-5增伤")

        this.add_action("/check 跳 9838", .7268, '共鸣技能', '固有1')
        this.add_action("/check 跳 14757", 1.0902, '共鸣技能', '固有1')

        this.add_action("跳", .7268 + 1.0902, '共鸣技能', '固有1')

        this.add_action("/check E 10507", .8188, '共鸣技能')
        this.add_action("/check E 21014", 1.6376, '共鸣技能')

        this.add_action("E", .8188 * 3 + 1.6376, '共鸣技能')

        this.add_buff("长离-5增伤")

        this.add_action("/check A 8118", .5895, '共鸣技能', '固有1')

        this.add_action("A", .5895 * 2 + .8252 + .9431, '共鸣技能', '固有1')

        this.add_action('/check Z 5855', .3925, '共鸣技能', '固有2')
        this.add_action('/check Z 68293', 4.5785, '共鸣技能', '固有2')
        this.add_action("Z", .3925 * 5 + 4.5785, '共鸣技能', '固有2')

        this.add_action('/check R 166348', 12.125, '共鸣解放', '固有2')
        this.add_action("R", 12.1275, '共鸣解放', '固有2')

        this.add_action('/check Z 3181*2= 6362', .3925, '共鸣技能', '固有2', '焰羽')
        this.add_action('/check Z 37096*2= 74192', 4.5785, '共鸣技能', '固有2', '焰羽')
        this.add_action("Z", .3925 * 5 + 4.5785, '共鸣技能', '固有2', '焰羽')


    }

}