练度流程列表['Phrolova'] = {
    标题: '弗洛洛 表级 1250313.3',
    声骸配置: {
        "声骸-1": "44%爆伤+150攻击",
        "声骸-2": "30%属伤+100攻击",
        "声骸-3": "30%属伤+100攻击",
        "声骸-4": "18%攻击+2280生命",
        "声骸-5": "18%攻击+2280生命",
        "声骸-暴击": "40.5",
        "声骸-爆伤": "81",
        "声骸-大攻击": "18",
        "声骸-小攻击": "0",
        "声骸-普攻伤害加成": "0",
        "声骸-重击伤害加成": "0",
        "声骸-共鸣技能伤害加成": "18",
        "声骸-共鸣解放伤害加成": "0",
        "敌方等级": "100",
        "敌方抗性": "20"
        // 总倍率: 82.8733 总加深倍率: 128.4943 总伤害: 1250313.3
        // 带守 x1.0203951281650767
        // 总倍率: 82.8733 总加深倍率: 128.4943 总伤害: 1275813.6
        // 二链至少
        // 总倍率: 124.6223 总加深倍率: 195.2927 总伤害: 1845026.1

        // ,  // 个人声骸
        // "声骸-暴击": "42.9",
        // "声骸-爆伤": 82.2 + 10 * 0,
        // "声骸-大攻击": 8.6 + 10 * 0,
        // "声骸-小攻击": "0",
        // "声骸-普攻伤害加成": "0",
        // "声骸-重击伤害加成": "0",
        // "声骸-共鸣技能伤害加成": 22.9 + 10 * 0,
        // "声骸-共鸣解放伤害加成": "0",
        // 总倍率: 82.8733 总加深倍率: 128.4943 总伤害: 1249084.9
        // 10爆伤 x1.0310543342570229
        // 总倍率: 82.8733 总加深倍率: 128.4943 总伤害: 1287874.4
        // 10攻击 x1.0336102854177487
        // 总倍率: 82.8733 总加深倍率: 128.4943 总伤害: 1291067
        // 10技伤 x1.0225188055671797
        // 总倍率: 82.8733 总加深倍率: 128.4943 总伤害: 1277212.8

    },
    buff_列表: {

        '角色基础': { 属性: { 暴击: 5, 爆伤: 150 } },
        // '敌方': { 属性: { 敌方等级: parseInt(参数设置.敌方等级), 抗性: parseInt(参数设置.敌方抗性) } },
        '弗洛洛': { 属性: { 等级: 90, 基础攻击: 438 - 2, 大攻击: 12, 暴击: 8 } },

        '弗洛洛-指挥状态-120攻': { 属性: { 大攻击: 120 } },

        '幽冥的忘忧章': { 属性: { 基础攻击: 588, 暴击: 24.3, 大攻击: 12 } },
        '幽冥的忘忧章-安魂曲-32技伤': { 属性: { 增伤: 32 }, 标签: '共鸣技能', 描述: '造成声骸技能伤害后12秒内，共鸣技能伤害加成提升32%，声骸技能伤害加深32%，且造成伤害时无视目标8%防御。' },
        '幽冥的忘忧章-安魂曲-32骸深': { 属性: { 加深: 32 }, 标签: '声骸技能', 描述: '造成声骸技能伤害后12秒内，共鸣技能伤害加成提升32%，声骸技能伤害加深32%，且造成伤害时无视目标8%防御。' },
        '幽冥的忘忧章-安魂曲-8防': { 属性: { 无视防御: 8 }, 描述: '造成声骸技能伤害后12秒内，共鸣技能伤害加成提升32%，声骸技能伤害加深32%，且造成伤害时无视目标8%防御。' },

        '失序彼岸之梦-20暴击': { 属性: { 暴击: 20 }, 描述: '角色共鸣能量为0时，自身暴击率提升20%，声骸技能伤害加成提升35%。' },
        '失序彼岸之梦-35骸伤': { 属性: { 增伤: 35 }, 标签: '声骸技能', 描述: '角色共鸣能量为0时，自身暴击率提升20%，声骸技能伤害加成提升35%。' },

        '暗2件-10暗伤': { 属性: { 增伤: 10 } },

        '梦魇·赫卡忒-12暗伤': { 属性: { 增伤: 12 } },
        '梦魇·赫卡忒-20骸伤': { 属性: { 增伤: 20 }, 标签: '声骸技能' },

        '坎特蕾拉-20暗深': { 属性: { 加深: 20 }, 描述: '持续14秒' },
        '坎特蕾拉-25技深': { 属性: { 加深: 25 }, 标签: '共鸣技能', 描述: '持续14秒' },

        '守岸人-12.5暴击': { 属性: { 暴击: 12.5 }, 描述: '星域持续时间30秒' },
        '守岸人-25爆伤': { 属性: { 爆伤: 25 }, 描述: '星域持续时间30秒' },
        '守岸人-15加深': { 属性: { 加深: 15 }, 描述: '队伍中的角色全伤害加深15%。最多存在30秒' },

        '维里奈-15加深': { 属性: { 加深: 15 }, 描述: '队伍中的角色全伤害加深15%。最多存在30秒' },
        '维里奈-20攻': { 属性: { 大攻击: 20 } },

        '轻云出月': { 属性: { 大攻击: 22.5 }, 描述: '使用延奏技能后，下一个登场的共鸣者攻击提升22.5%，持续15秒' },
        '无常凶鹭': { 属性: { 增伤: 12 }, 描述: '下一个变奏登场的角色伤害提升12%，持续15秒。技能冷却：20秒' },

        '隐世回光': { 属性: { 大攻击: 15 }, 描述: '自身为友方提供治疗时，全队共鸣者攻击提升15%，持续30秒' },
        '无归的谬误': { 属性: { 大攻击: 10 }, 描述: '全队角色攻击提升10%，持续20秒。技能冷却：20秒' },

        '鸣钟之龟': { 属性: { 增伤: 10 }, 描述: '持续15秒。鸣钟之盾能为队伍中登场角色提供50.00%的减伤和10.00%的伤害提升，受到3次攻击后消失。' },

        // ...声骸属性,
        "声骸-实战": { "属性": { "爆伤": 44, "小攻击": 350, "增伤": 60, "大攻击": 36 }, "标签": "实战" },
        "声骸-实战-副词条": { "属性": { "暴击": 42.9, "爆伤": 82.2, "大攻击": 8.6, "小攻击": 0 }, "标签": "实战" },
        "声骸-实战-副词条-共鸣技能": { "属性": { "增伤": 22.9 }, "标签": "共鸣技能,实战" },

        '余响-2.5爆伤': { 属性: { 爆伤: 2.5 }, 描述: '余响上限为24层。' },
        '余响-1爆伤': { 属性: { 爆伤: 2.5 }, 描述: '最多通过该方式提升100%' },
        '余响-谱曲终末': { 属性: { 倍率提升: 82.55 / 660.16 }, 标签: '谱曲终末', 描述: '余响上限为24层。' },

        '深塔-20攻': { 属性: { 大攻击: 20 }, 标签: '实战' },
        '深塔-90级': { 属性: { 敌方等级: -10 }, 标签: '实战' },
    },
    流程: function () {

        this.add_buff('敌方属性')
        this.add_buff('角色基础')
        this.add_buff('弗洛洛')
        this.add_buff('幽冥的忘忧章')

        this.add_buff('失序彼岸之梦-20暴击')
        this.add_buff('失序彼岸之梦-35骸伤')
        this.add_buff('暗2件-10暗伤')
        this.add_buff('梦魇·赫卡忒-12暗伤')
        this.add_buff('梦魇·赫卡忒-20骸伤')

        for (const key in this.buff_列表) {
            if (!key.startsWith('声骸'))
                continue
            this.add_buff(key)
        }

        this.add_buff('余响-2.5爆伤', 10)
        // this.add_buff('余响-1爆伤', 0)
        this.add_buff('余响-谱曲终末', 10)

        for (const key in this.buff_列表) {
            if (!key.startsWith('深塔'))
                continue
            this.add_buff(key)
        }

        this.add_action("/check a2 4782", .9543, '普攻')

        this.add_action("/check q 9943", 1.5239, '声骸技能')

        this.add_buff('幽冥的忘忧章-安魂曲-32技伤')
        this.add_buff('幽冥的忘忧章-安魂曲-32骸深')
        this.add_buff('幽冥的忘忧章-安魂曲-8防')

        this.add_action("/check q 13670", 1.5239, '声骸技能')

        this.add_action("/check A 8005", 1.1783, '共鸣技能')

        this.add_buff('坎特蕾拉-20暗深')
        this.add_buff('坎特蕾拉-25技深')
        // this.add_buff('守岸人-12.5暴击')
        // this.add_buff('守岸人-25爆伤')
        // this.add_buff('守岸人-15加深')
        this.add_buff('维里奈-15加深')

        const 带守 = false

        this.add_buff('维里奈-20攻')
        if (带守) this.add_buff('维里奈-20攻', -1 + 1 / 20 * 11.6 / 10.5 * 12.5)
        this.add_buff('轻云出月')
        this.add_buff('隐世回光')
        this.add_buff('无归的谬误')
        // this.add_buff('鸣钟之龟')

        this.add_buff('余响-2.5爆伤', 7)
        this.add_buff('余响-谱曲终末', 7)

        this.add_action("/check A 17666", 1.1783, '共鸣技能')

        this.add_buff('无常凶鹭')

        if (带守) this.add_buff('守岸人-25爆伤')

        this.add_action("/check 强化变奏 81160", 5.1525, '共鸣技能')
        this.add_action("强化变奏", 5.9643, '共鸣技能')

        this.add_action("/check a3 3387", .3269, '普攻')
        this.add_action("a1*2+a2*2+a3/6*3", .5345 * 2 * 2 + .9543 * 2 + .3269 * 6 / 6 * 3, '普攻')

        this.add_action("/check A 18560", 1.1783, '共鸣技能')
        this.add_action("A*4", (.3788 * 4 + 1.1783 * 3) * 4, '共鸣技能')

        this.add_action("/check e5级 11427", .7254, '共鸣技能')
        this.add_action("e", 1.0597 * 2, '共鸣技能')

        this.add_action("/check q 25063", 1.5239, '声骸技能')
        this.add_action("q", 1.5239 * 3, '声骸技能')

        this.add_action("/check Z 6101", .1238, '共鸣技能', '谱曲终末')
        this.add_action("/check Z 243712", 4.9510, '共鸣技能', '谱曲终末')
        this.add_action("Z", .3301 * 2 + .1238 * 8 + 4.9510, '共鸣技能', '谱曲终末')


        this.add_buff('坎特蕾拉-20暗深', -1)
        this.add_buff('坎特蕾拉-25技深', -1)

        this.add_buff('弗洛洛-指挥状态-120攻')

        this.add_buff('余响-2.5爆伤', 1)
        this.add_buff('余响-谱曲终末', 1)

        if (带守) this.add_buff('守岸人-12.5暴击', -1)
        if (带守) this.add_buff('守岸人-25爆伤', -1)

        this.add_action("/check 赫卡忒 21526", 1.0438, '声骸技能')
        this.add_action("赫卡忒", 1.0438 + 2.4355, '声骸技能')
        this.add_buff('余响-2.5爆伤', 1)
        this.add_action("赫卡忒", 1.0438 + 2.4355, '声骸技能')

        this.add_buff('轻云出月', -1)
        this.add_buff('无归的谬误', -1)
        this.add_buff('无常凶鹭', -1)

        if (带守) this.add_buff('守岸人-12.5暴击', 1)

        this.add_buff('余响-2.5爆伤', 1)
        this.add_action("/check 赫卡忒 19162", 1.0438, '声骸技能')
        this.add_action("赫卡忒", 1.0438 + 2.4355, '声骸技能')
        this.add_buff('余响-2.5爆伤', 1)
        this.add_action("赫卡忒", 1.0438 + 2.4355, '声骸技能')
        this.add_buff('余响-2.5爆伤', 1)
        this.add_action("赫卡忒", 1.0438 + 2.4355, '声骸技能')
        this.add_buff('余响-2.5爆伤', 1)
        this.add_action("赫卡忒", 1.0438 + 2.4355, '声骸技能')
        this.add_buff('余响-2.5爆伤', 1)
        this.add_action("赫卡忒", 1.0438 + 2.4355, '声骸技能')



        // 第一段伤害
        // .5345*2
        // 第二段伤害
        // .9543
        // 第三段伤害
        // .3269*6
        // 重击伤害
        // .7985*2
        // 谱曲终末伤害
        // .3301*2+.1238*8+4.9510
        // 每层余响增加倍率
        // .8255

        // 技能伤害
        // 1.0597*2
        // 亡与死的乐章伤害
        // .3788*4+1.1783*3
        // 强化攻击·彩乐·赫卡忒伤害
        // 1.0438+2.4355

        // 永生组歌伤害
        // 5.9643

        // (\d\d)\.(\d\d)%
        // .$1$2

    }

}