练度流程列表['xiangliyao'] = {
    标题: '相里要',
    声骸配置: {
        "声骸-1": "22%暴击+150攻击",
        "声骸-2": "30%属伤+100攻击",
        "声骸-3": "30%属伤+100攻击",
        "声骸-4": "18%攻击+2280生命",
        "声骸-5": "18%攻击+2280生命",
        "声骸-暴击": "42",
        "声骸-爆伤": "84",
        "声骸-大攻击": "45",
        "声骸-小攻击": "0",
        "声骸-普攻伤害加成": "0",
        "声骸-重击伤害加成": "0",
        "声骸-共鸣技能伤害加成": "0",
        "声骸-共鸣解放伤害加成": "45",
        "敌方等级": "100",
        "敌方抗性": "20"
    },
    buff_列表: {

        '角色基础': { 属性: { 暴击: 5, 爆伤: 150 } },
        // '敌方': { 属性: { 敌方等级: parseInt(参数设置.敌方等级), 抗性: parseInt(参数设置.敌方抗性) } },
        '相里要': { 属性: { 等级: 90, 基础攻击: 425 - 1, 大攻击: 12, 爆伤: 16 } },
        '相里要-固有没点': { 属性: { 大攻击: -8.4 }, 标签: '实战' },
        '诸方玄枢': { 属性: { 基础攻击: 588, 暴击: 24.3, 增伤: 12 } },
        '诸方玄枢-48解放': { 属性: { 增伤: 48 }, 标签: '共鸣解放', 描述: '施放共鸣解放时，自身共鸣解放伤害加成提升48%，持续8秒；施放共鸣技能时，该效果延长5秒，最多可延长3次。' },
        // '死与舞-缄默悼词': { 属性: { 增伤: 48 }, 标签: '共鸣技能', 描述: '施放变奏技能或共鸣解放时，自身共鸣技能伤害加成提升48%，持续5秒。' },
        '相里要-5导电*4-用共鸣': { 属性: { 增伤: 5 }, 描述: '施放共鸣技能时，导电伤害加成提升5%，持续8秒，可叠加4层。' },

        '彻空冥雷-2': { 属性: { 增伤: 10 } },
        '彻空冥雷-5': { 属性: { 增伤: 15 }, 描述: '使用重击或共鸣技能时，各获得一层导电伤害提升15%的效果，该效果可叠加两层，每层各持续15秒' },
        // '凌冽决断之心-5-释放共鸣解放': { 属性: { 增伤: 18 }, 标签: '共鸣技能', 描述: '施放共鸣解放时，自身共鸣技能伤害提升18%，持续5秒，可叠加2层' },
        '梦魇·云闪之鳞-导电': { 属性: { 增伤: 12 } },
        '梦魇·云闪之鳞-共鸣解放': { 属性: { 增伤: 12 }, 标签: '共鸣解放' },

        '长离-25解放加深': { 属性: { 加深: 25 }, 标签: '共鸣解放' },
        // '折枝-冷凝加深': { 属性: { 加深: 20 }, 标签: '冷凝', 描述: '持续14秒' },
        // '折枝-共鸣技能加深': { 属性: { 加深: 25 }, 标签: '共鸣技能', 描述: '持续14秒' },

        '守岸人-领域': { 属性: { 暴击: 12.5, 爆伤: 25 }, 描述: '星域持续时间30秒' },
        '守岸人-延奏': { 属性: { 加深: 15 }, 描述: '队伍中的角色全伤害加深15%。最多存在30秒' },

        // '轻云出月': { 属性: { 大攻击: 22.5 }, 描述: '使用延奏技能后，下一个登场的共鸣者攻击提升22.5%，持续15秒' },
        // '无常凶鹭': { 属性: { 增伤: 12 }, 描述: '下一个变奏登场的角色伤害提升12%，持续15秒。技能冷却：20秒' },

        '隐世回光': { 属性: { 大攻击: 15 }, 描述: '自身为友方提供治疗时，全队共鸣者攻击提升15%，持续30秒' },
        '无归的谬误': { 属性: { 大攻击: 10 }, 描述: '全队角色攻击提升10%，持续20秒。技能冷却：20秒' },

        // ...声骸属性,
        "声骸-实战": { "属性": { "爆伤": 44, "小攻击": 350, "增伤": 60, "大攻击": 36 }, "标签": "实战" },
        "声骸-实战-副词条": { "属性": { "暴击": 39.3, "爆伤": 76.2, "大攻击": 18, "小攻击": 40 }, "标签": "实战" },
        "声骸-实战-副词条-共鸣技能": { "属性": { "增伤": 18.7 }, "标签": "共鸣技能,实战" },
        "声骸-实战-副词条-重击": { "属性": { "增伤": 9.4 }, "标签": "重击,实战" },
        "声骸-实战-副词条-共鸣解放": { "属性": { "增伤": 23.7 }, "标签": "共鸣解放,实战" },

        // '解离-减防18%': { 属性: { 减防: 18 }, 描述: '珂莱塔攻击携带解离效果的目标，造成伤害时忽视目标18%防御。变奏ZER都能触发' },
        // '揭幕者-倍率提升80%': { 属性: { 倍率提升: 0.8 }, 标签: '揭幕者', 描述: '共鸣解放新浪潮时代、共鸣解放死兆、共鸣解放致死以终的伤害倍率提升80%' },

        '深塔-90级': { 属性: { 敌方等级: -10 }, 标签: '实战' },
        '深塔-20攻': { 属性: { 大攻击: 20 }, 标签: '实战' },
    },
    流程: function () {

        console.log(JSON.stringify(Object.keys(this.buff_列表)))

        this.add_buff("角色基础")
        this.add_buff("敌方属性")
        this.add_buff("相里要")
        this.add_buff("相里要-固有没点")

        this.add_buff("诸方玄枢")

        for (const key in this.buff_列表) {
            if (!key.startsWith('声骸'))
                continue
            this.add_buff(key)
        }

        this.add_buff("深塔-90级")
        this.add_buff("彻空冥雷-2")

        this.add_buff("梦魇·云闪之鳞-导电")
        this.add_buff("梦魇·云闪之鳞-共鸣解放")
        this.add_buff("深塔-20攻")
        this.add_buff("诸方玄枢-48解放")



        this.add_buff("隐世回光")
        this.add_buff("彻空冥雷-5", 2)
        this.add_buff("相里要-5导电*4-用共鸣", 1)
        // 04:38:44
        this.add_buff("无归的谬误")

        this.add_action('/check R 128341', 14.6606, '共鸣解放')


        this.add_buff("守岸人-延奏")


        this.add_buff("长离-25解放加深")
        this.add_buff("守岸人-领域")
        this.add_buff("相里要-5导电*4-用共鸣", 1)


        // 04:29:32
        this.add_action('/check R 198497', 14.6606, '共鸣解放')

        this.add_buff("长离-25解放加深", -1)

        this.add_buff("相里要-5导电*4-用共鸣", 1)
        this.add_action('/check 下落 2471', .2187, '共鸣解放')
        this.add_buff("相里要-5导电*4-用共鸣", 1)
        this.add_action('/check E 29286', 2.5528, '共鸣解放')

        this.add_action('/check E 10982 ', .9573, '共鸣解放')

        // // 04:19:67 EE 最后两层
        // this.add_buff("相里要-5导电*4-用共鸣", 1)



        this.add_action('/check E 4561', .4959, '共鸣技能')
        this.add_action('/check E 15961', 1.7355, '共鸣技能')

        this.add_buff("无归的谬误", -1)

        this.add_action('/check 下落 2405', .2187, '共鸣解放')
        // E 49.59%*3+173.55%*2

        this.add_buff("长离-25解放加深")
        this.add_buff("深塔-20攻", -1)
        this.add_buff("彻空冥雷-5", -1)
        this.add_buff("相里要-5导电*4-用共鸣", -3)
        this.add_buff("无归的谬误")

        // 04:06:72 只有1层
        this.add_action('/check E 29706', 2.5528, '共鸣解放')

        // %*4+65.61%*2
    }

}