练度流程列表['zanni'] = {
    标题: '01赞00菲00守，赞妮154.32w', // 总倍率67.2777
    声骸配置: {
        "声骸-1": "44%爆伤+150攻击",
        "声骸-2": "30%属伤+100攻击",
        "声骸-3": "30%属伤+100攻击",
        "声骸-4": "18%攻击+2280生命",
        "声骸-5": "18%攻击+2280生命",
        "声骸-暴击": "42",
        "声骸-爆伤": "84",
        "声骸-大攻击": "45",
        "声骸-小攻击": "0",
        "声骸-普攻伤害加成": "0",
        "声骸-重击伤害加成": "27",
        "声骸-共鸣技能伤害加成": "0",
        "声骸-共鸣解放伤害加成": "0",
        "敌方等级": "100",
        "敌方抗性": "20"
    },
    buff_列表: {

        // '角色基础': { 属性: { 暴击: 5, 爆伤: 150 } },
        // '敌方': { 属性: {} },
        '赞妮': {
            属性: {
                基础攻击: 438 - 2,
                大攻击: 12,
                暴击: 5 + 8,
                爆伤: 150,
                等级: 90,
            },
        },

        '焰光裁定': { 属性: { 基础攻击: 588, 爆伤: 48.6, 大攻击: 12 } },

        '焰光裁定-8无视防御': { 属性: { 无视防御: 8 }, 描述: '施放普攻时，获得以下效果：自身造成伤害无视目标8%防御，同时自身直接造成的【光噪效应】伤害加深50%，持续6秒。重复获得时刷新持续时间。' },
        '焰光裁定-50光噪': { 属性: { 加深: 50 }, 标签: '光噪', 描述: '施放普攻时，获得以下效果：自身造成伤害无视目标8%防御，同时自身直接造成的【光噪效应】伤害加深50%，持续6秒。重复获得时刷新持续时间。' },
        '4C-12增伤': { 属性: { 增伤: 12 } },
        '3C-12重击': { 属性: { 增伤: 12 }, 标签: '拉表' },
        '此间永驻之光-10光伤': { 属性: { 增伤: 10 } },
        '此间永驻之光-20暴击': { 属性: { 暴击: 20 } },
        '此间永驻之光-15光伤': { 属性: { 增伤: 15 }, 描述: '攻击存在10层【光噪效应】的敌人时，自身衍射伤害加成提升15%，持续15秒。' },
        '和光回唱-30光噪': { 属性: { 加深: 30 }, 标签: '光噪', 描述: '施放延奏技能时，使队伍中登场角色周围的目标受到【光噪效应】伤害加深30%，持续30秒，' },
        '菲比-100光噪': { 属性: { 加深: 100 }, 标签: '光噪', 描述: '使一定范围内的目标衍射伤害抗性减少10%，【光噪效应】伤害加深100%。' },
        '菲比-10抗': { 属性: { 抗性: -10 }, 描述: '使一定范围内的目标衍射伤害抗性减少10%，【光噪效应】伤害加深100%。' },
        '赞妮-20光噪': { 属性: { 加深: 20 }, 标签: '光噪', 描述: '自身直接造成的【光噪效应】伤害加深20%。' },
        '赞妮-12光伤-变奏': { 属性: { 增伤: 12 }, 描述: '施放变奏技能即刻执行时，衍射伤害加成提升12%，持续14秒。' },

        '轻云出月-22.5攻-15s': { 属性: { 大攻击: 22.5 }, 描述: '使用延奏技能后，下一个登场的共鸣者攻击提升22.5%，持续15秒' },
        '无常凶鹭-12增伤-15s': { 属性: { 增伤: 12 }, 描述: '下一个变奏登场的角色伤害提升12%，持续15秒。技能冷却：20秒' },

        '隐世回光-15攻-30s': { 属性: { 大攻击: 15 }, 描述: '自身为友方提供治疗时，全队共鸣者攻击提升15%，持续30秒' },
        '无归的谬误-10攻-20s': { 属性: { 大攻击: 10 }, 描述: '全队角色攻击提升10%，持续20秒。技能冷却：20秒' },

        '守岸人-12.5暴击': { 属性: { 暴击: 12.5 }, 描述: '星域持续时间30秒' },
        '守岸人-25爆伤': { 属性: { 爆伤: 25 }, 描述: '星域持续时间30秒' },
        '守岸人-15加深': { 属性: { 加深: 15 }, 描述: '队伍中的角色全伤害加深15%。最多存在30秒' },

        // '守岸人-12.5暴击': { 属性: { 暴击: 0 }, 描述: '星域持续时间30秒' },
        // '守岸人-25爆伤': { 属性: { 爆伤: 0 }, 描述: '星域持续时间30秒' },
        // '守岸人-15加深': { 属性: { 抗性: -10 }, 描述: '队伍中的角色全伤害加深15%。最多存在30秒' },

        '深塔-5爆伤-R后': { 属性: { 爆伤: 5 }, 标签: '实战', 描述: '施放共鸣解放时，自身暴击伤害提升5%，共鸣技能伤害加成提升10%，持续3秒，最多叠加4层。角色离场时清除所有效果。' },
        '深塔-10技能-R后': { 属性: { 增伤: 10 }, 标签: '共鸣技能,实战', 描述: '施放共鸣解放时，自身暴击伤害提升5%，共鸣技能伤害加成提升10%，持续3秒，最多叠加4层。角色离场时清除所有效果。' },
        '深塔-90': { 属性: { 敌方等级: -10 }, 标签: '实战' },


        '声骸-实战': { "属性": { "爆伤": 44, "小攻击": 350, "增伤": 60, "大攻击": 36 }, "标签": "实战" },
        '声骸-副词条-实战': { "属性": { "暴击": 41.1, "爆伤": 121.4 - 44, "大攻击": 8.6, 小攻击: 50 }, "标签": "实战" },
        '声骸-副词条-普攻-实战': { "属性": { "增伤": 9.4 }, "标签": "普攻,实战" },
        '声骸-副词条-重击-实战': { "属性": { "增伤": 16.5 }, "标签": "重击,实战" },
        '声骸-副词条-共鸣技能-实战': { "属性": { "增伤": 31.1 }, "标签": "共鸣技能,实战" },
        '声骸-副词条-共鸣解放-实战': { "属性": { "增伤": 10.1 }, "标签": "共鸣解放,实战" },

    },
    流程: function () {

        this.add_buff("赞妮")
        this.add_buff("敌方属性")
        this.add_buff("焰光裁定")
        this.add_buff("4C-12增伤")
        this.add_buff('3C-12重击')
        this.add_buff("此间永驻之光-10光伤")
        this.add_buff("此间永驻之光-20暴击")
        for (const key in this.buff_列表) {
            if (!key.startsWith('声骸'))
                continue
            this.add_buff(key)
        }


        this.add_buff('深塔-90')

        // E2本身没有普攻动作，但是切人瞬间有普攻动作
        // E2能吃到20光噪
        this.add_buff("赞妮-20光噪")
        // this.add_action("/check E2 /5级 8229", 1.1799, '共鸣技能', '光噪')

        this.add_buff("焰光裁定-8无视防御")
        this.add_buff("焰光裁定-50光噪")
        // this.add_action("/check E2 /5级 6072", .5900, '共鸣技能', '光噪')
        // this.add_action("/check E2 /5级 12142", 1.1799, '共鸣技能', '光噪')
        this.add_buff("隐世回光-15攻-30s")
        this.add_buff("此间永驻之光-15光伤")
        this.add_action("/check E2 /5级 13933", 1.1799, '共鸣技能', '光噪')
        this.add_action("集中压制伤害", .8619 + .2873 + 1.7237, '共鸣技能', '光噪')

        this.add_buff("无归的谬误-10攻-20s")
        this.add_buff('守岸人-15加深')
        this.add_buff('守岸人-12.5暴击')
        this.add_buff('守岸人-25爆伤')

        this.add_buff("轻云出月-22.5攻-15s")
        this.add_buff("无常凶鹭-12增伤-15s")
        // this.add_buff("和光回唱-30光噪")

        // 3:54:74
        this.add_buff("赞妮-12光伤-变奏")
        this.add_action('/check 变奏1级 1167', .1220)
        this.add_action("变奏", .2424 * 5 + .8080)
        this.add_buff("菲比-10抗")
        this.add_buff("菲比-100光噪")

        this.add_action("Q", 1.1880 + .5940 * 4)

        this.add_buff('深塔-5爆伤-R后')
        this.add_action("/check R1 8级 31407", 2.7517, '共鸣解放')
        this.add_action("重燃伤害", 3.1852, '共鸣解放')

        // 60 + 25 + 15
        this.add_action('/check 34677', 1.9881 * 3420 / (3420 + 1425 + 855), '光噪', '重击')
        // this.add_action('/check 1524', 1.9881 * 1425 / (3420 + 1425 + 855), '光噪', '重击')
        // this.add_action('/check 915', 1.9881 * 855 / (3420 + 1425 + 855), '光噪', '重击')

        // 8 + 11 * 2 + 35 * 2
        // this.add_action('/check 1041', 4.2407 * 1041 / (1041 + 1431 * 2 + 4551 * 2), '光噪', '重击')
        this.add_action('/check 43147', 4.2407 * 4551 / (1041 + 1431 * 2 + 4551 * 2), '光噪', '重击')
        // this.add_action('/check 1431', 4.2407 * 1431 / (1041 + 1431 * 2 + 4551 * 2), '光噪', '重击')

        this.add_buff('深塔-5爆伤-R后', -1)

        // 0.1177 * 2 + 0.3823 * 2
        this.add_action('/check 4559', 1.3520 * 0.1177, '光噪', '重击')
        this.add_action('/check 29070', 1.3520 * 0.3823 + 5 * .0995, '光噪', '重击')
        // this.add_action('/check 3110*2+488*2= 7196', 1.3520 + 10 * .0728, '光噪', '重击')
        // this.add_action('/check 5488+245*2+854+10366= 17198', 2.6243 + 30 * .0728, '光噪', '重击')
        // this.add_action('/check 3050', 10 * .0728, '光噪', '重击')
        this.add_action('/check 51299', 2.6243 * 0.303 + 10 * .0995, '光噪', '重击')
        this.add_action('/check 2281', 2.6243 * 0.03033, '光噪', '重击')
        this.add_action('/check 7978', 2.6243 * 0.1061, '光噪', '重击')
        this.add_action('/check 20尾刀 96898', 2.6243 * 0.5305 + 20 * .0995, '光噪', '重击')

        this.add_action("重斩·破晓伤害", 1.9881, '光噪', '重击')
        this.add_action("重斩·将明伤害", 4.2407, '光噪', '重击')
        this.add_action("重斩·终夜伤害", 1.3520 + 2.6243, '光噪', '重击')
        this.add_action("40【焰光】", 0.0995 * 40, '光噪', '重击')

        this.add_action("重斩·破晓伤害", 1.9881, '光噪', '重击')
        this.add_action("重斩·将明伤害", 4.2407, '光噪', '重击')
        this.add_action("重斩·终夜伤害", 1.3520 + 2.6243, '光噪', '重击')
        this.add_action("10【焰光】", 0.0995 * 10, '光噪', '重击')

        this.add_action('/check 第3轮 破晓 34181', 1.9881 * 0.6, '光噪', '重击')
        this.add_action('/check 第3轮 将明 42531', 4.2407 * 0.35, '光噪', '重击')
        this.add_action('/check 第3轮 将明 13367', 4.2407 * 0.11, '光噪', '重击')
        this.add_action('/check 第3轮 将明 9723', 4.2407 * 0.08, '光噪', '重击')
        this.add_action("重斩·破晓伤害", 1.9881, '光噪', '重击')
        this.add_action("重斩·将明伤害", 4.2407, '光噪', '重击')

        this.add_buff("赞妮-20光噪", -1)

        this.add_action('/check 第3轮 终夜 4239', 1.3520 * 0.1177, '光噪', '重击')
        this.add_action('/check 第3轮 终夜 27030', 1.3520 * 0.3823 + 5 * .0995, '光噪', '重击')
        this.add_action('/check 第3轮 终夜 47699', 2.6243 * 0.303 + 10 * .0995, '光噪', '重击')
        this.add_action('/check 第3轮 终夜 2121', 2.6243 * 0.03033, '光噪', '重击')
        this.add_action("重斩·终夜伤害1段+10焰光", 1.3520 + 10 * .0995, '光噪', '重击')
        this.add_action("重斩·终夜伤害2段+5焰光", 2.6243 * (0.303 + 0.03033 * 2 - .00026) + 5 * .0995, '光噪', '重击')

        this.add_buff("赞妮-12光伤-变奏", -1)
        this.add_action('/check 第3轮 终夜 7043', 2.6243 * 0.1061, '光噪', '重击')
        this.add_action('/check 第3轮 终夜 20尾刀 72961', 2.6243 * 0.5305 + 15 * .0995, '光噪', '重击')
        this.add_action("重斩·终夜伤害2段 ", 2.6243 * (0.1061 + 0.5305), '光噪', '重击')

        this.add_buff('深塔-5爆伤-R后')

        this.add_action("/check R2 8级 5105*3.5= 17867.5", 1.651, '共鸣解放')
        this.add_action("/check R2 8级 101235", 9.3556, '共鸣解放')
        this.add_action("终绝将至之刻伤害", 1.9112 + 10.8296, '共鸣解放')

        this.add_buff('深塔-10技能-R后')

        this.add_action("/check 标准防卫预案伤害 5级 5407", .4377, '共鸣技能')
        this.add_action("/check 普攻第三段伤害1级", .2134, '普攻')
        this.add_action("标准防卫预案伤害", .6394, '共鸣技能')
        this.add_action("普攻第三段伤害", .4242 * 3, '普攻')

        this.add_buff("轻云出月-22.5攻-15s", -1)
        this.add_buff("无常凶鹭-12增伤-15s", -1)
        this.add_buff('深塔-5爆伤-R后', -1)

        // 还能吃到守岸人大招
        this.add_action("/check 16层延奏 78596", 1.50 * (1 + 16 * 0.1), '光噪')
        this.add_action("延奏", 1.50 * (1 + 16 * 0.1), '光噪')

    }

}